artillery-test.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 5
      name: Warm up
    - duration: 120
      arrivalRate: 20
      name: Sustained load
    - duration: 60
      arrivalRate: 50
      name: Spike test
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Board collaboration simulation"
    weight: 100
    flow:
      # Login
      - post:
          url: "/api/auth/login"
          json:
            email: "demo@example.com"
            password: "password123"
          capture:
            - json: "$.token"
              as: "token"

      - think: 1 # Brief pause to mimic a real user

      # Get boards
      - get:
          url: "/api/boards"
          headers:
            Authorization: "Bearer {{ token }}"

      - think: 2 # Simulate user browsing the boards